The [EKS API Reference](https://docs.aws.amazon.com/eks/latest/APIReference/API_CreateNodegroup.html#AmazonEKS-CreateNodegroup-request-remoteAccess) denotes the remote access configuration as a separate API structure/object, which maps best in Terraform as a configuration block. We typically do not want to introduce our own abstractions on top of the API as they can easily become invalid or outdated. The EKS API also does not support adding or removing the remote access configuration via in-place update, so the `ForceNew: true` on the attribute is expected so Terraform can correctly replace the resource to match the configuration.

The Terraform configuration given above:

```hcl
resource "aws_eks_node_group" "example" {
  # ... other configuration ...

  remote_access {}
}
```

Would only be valid if the API accepted enabling remote access for EKS Node Groups with some sort of default or automatically generated EC2 Key Pair. If the API _does_ support this type of functionality, we should implement this as a separate feature request.

Terraform 0.12 supports new [`dynamic` blocks](https://www.terraform.io/docs/configuration/expressions.html#dynamic-blocks), which allows Terraform to optionally create or omit configuration blocks based on an input. In many Terraform providers, with Terraform 0.11 and earlier which did not support `dynamic`, we did occassionally implement these workarounds of allowing empty argument values (such as `""`). The maintainers prefer to not implement that type of extra logic going forward since it introduces ambiguity and abstraction in the provider as compared to the given configuration (such as needing to implement additional difference suppression logic, which will likely not be valid in future versions of Terraform).

To throw together a quick example of this in practice, slighly modifying the repository [`examples/eks-getting-started`](https://github.com/terraform-providers/terraform-provider-aws/tree/master/examples/eks-getting-started) with the following configuration:

```hcl
variable "remote_access_key" {
  default = ""
  type    = string
}

resource "aws_key_pair" "remote_access_key" {
  count = length(var.remote_access_key) > 0 ? 1 : 0

  key_name   = "remote_access"
  public_key = var.remote_access_key
}

resource "aws_eks_node_group" "demo" {
  cluster_name    = aws_eks_cluster.demo.name
  node_group_name = "demo"
  node_role_arn   = aws_iam_role.demo-node.arn
  subnet_ids      = aws_subnet.demo[*].id

  dynamic "remote_access" {
    for_each = aws_key_pair.remote_access_key

    content {
      ec2_ssh_key = remote_access.value.key_name
    }
  }

  scaling_config {
    desired_size = 1
    max_size     = 1
    min_size     = 1
  }

  depends_on = [
    aws_iam_role_policy_attachment.demo-node-AmazonEKSWorkerNodePolicy,
    aws_iam_role_policy_attachment.demo-node-AmazonEKS_CNI_Policy,
    aws_iam_role_policy_attachment.demo-node-AmazonEC2ContainerRegistryReadOnly,
  ]
}
```

With variable set to `default = ""`:

```
  # aws_eks_node_group.demo will be created
  + resource "aws_eks_node_group" "demo" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + cluster_name    = "terraform-eks-demo"
      + disk_size       = (known after apply)
      + id              = (known after apply)
      + instance_types  = (known after apply)
      + node_group_name = "demo"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + version         = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }
    }
```

With variable set to `default = "...key contents..."`:

```
  # aws_eks_node_group.demo will be created
  + resource "aws_eks_node_group" "demo" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + cluster_name    = "terraform-eks-demo"
      + disk_size       = (known after apply)
      + id              = (known after apply)
      + instance_types  = (known after apply)
      + node_group_name = "demo"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + version         = (known after apply)

      + remote_access {
          + ec2_ssh_key = "remote_access"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }
    }
```

Hopefully this helps get you started on how you can introduce this concept into your configurations. Its certainly possible to implement a more complex `dynamic` configuration that can also account for handling source security groups as well, but that is outside the scope of this issue. If you are interested in potential feature requests for improving/simplifying these types of configurations in Terraform, please submit an [issue following the feature request template in the Terraform repository](https://github.com/hashicorp/terraform/issues/new?labels=enhancement&template=feature_request.md).

If you're looking for general assistance beyond the above, please note that we use GitHub issues in this repository for tracking bugs and enhancements with the Terraform AWS Provider codebase rather than for questions. While we may be able to help with certain simple problems here it's generally better to use the [community forums](https://discuss.hashicorp.com/c/terraform-providers) where there are far more people ready to help, whereas the GitHub issues here are generally monitored only by a few maintainers and dedicated community members interested in code development of the Terraform AWS Provider itself.